config.org
#+TITLE: Config
#+PROPERTY: header-args :tangle config.el

* Info
#+begin_src emacs-lisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
(setq user-full-name "name"
      user-mail-address "***REMOVED***")
#+end_src
* Display
** Custom face
#+begin_src emacs-lisp
#+end_src
** Hidpi
for hidpi monitor, doom-font setting are bugy
https://unix.stackexchange.com/questions/242067/emacs-on-hidpi-screen-renders-unreadable-fonts-arch-linux
#+begin_src emacs-lisp
(if (equal (display-pixel-width) 3840)
    ((add-to-list 'default-frame-alist '(font . "JetBrains Mono-14"))
     (set-face-attribute 'default t :font "JetBrains Mono-14"))
  ((add-to-list 'default-frame-alist '(font . "JetBrains Mono"))
   (set-face-attribute 'default t :font "JetBrains Mono"))
  )
#+end_src
** fonts
*bold* and /italic/ are enabled
#+begin_src emacs-lisp
;;(if (equal (display-pixel-width) 3840)
;;    (setq doom-font (font-spec :family "Inconsolata" :size 48)
;;          doom-variable-pitch-font (font-spec :family "Source Code Pro" :size 40))
;;  (setq doom-font (font-spec :family "Inconsolata")
;;        doom-variable-pitch-font (font-spec :family "Inconsolata")))
(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))
#+end_src
** Themes
#+begin_src emacs-lisp
(setq doom-theme 'doom-snazzy)
#+end_src
** Icons
#+begin_src emacs-lisp
(use-package all-the-icons
  :config
  (setq all-the-icons-scale-factor 0.75))
#+end_src
** Line
#+begin_src emacs-lisp
(setq display-line-numbers-type 'relative)
#+end_src
* Editing
** About Parenthese
#+begin_src emacs-lisp
(setq show-paren-style 'expression)
(electric-pair-mode 1)
#+end_src
* Org
#+begin_src emacs-lisp
(after! org
  (setq org-directory "~/org/")
  (setq org-agenda-files '("~/org/gtd/inbox.org"
                           "~/org/gtd/todo.org"
                           "~/org/gtd/projects.org"))
  (setq org-capture-templates '(("t" "Todo [inbox]" entry
                               (file+headline "~/org/gtd/inbox.org" "Inbox")
                               "* TODO %i%?")
                              ("s" "Someday" entry
                               (file+headline "~/org/gtd/inbox.org" "Someday")
                               "* HOLD %i%? \n %U")))
  (setq org-log-done 'time)
  ;;(setq org-todo-keywords '((sequence "TODO(t)" "STRT(s)" "WAIT(w@)" "HOLD(h)" "|" "DONE(d!)" "KILL(k@)")
  ;;                          (sequence "[ ](T)" "[-](S)" "[?](W@)" "|" "[x](D)")))
  ;;(setq org-modules '(org-habit))
  )
#+end_src
* Plugins
** doom-modeline
#+begin_src emacs-lisp
(use-package doom-modeline
  :ensure t
  :hook (after-init . doom-modeline-mode)
  :config
  (set-face-attribute 'mode-line nil :family "JetBrains Mono" :height 135)
  (set-face-attribute 'mode-line-inactive nil :family "JetBrains Mono" :height 135)
  (setq inhibit-compacting-font-caches t
        doom-modeline-height 1
        doom-modeline-buffer-file-name-style 'auto
        doom-modeline-buffer-encoding nil))
#+end_src

** treemacs
#+begin_src emacs-lisp
(use-package treemacs
  :config
  (progn
    (setq treemacs-width 17))
  ;;(treemacs-resize-icons 11)
  )
#+end_src
* Others
** [[https://github.com/hlissner/doom-emacs/issues/397][maximize when start up]]
#+begin_src emacs-lisp
(add-to-list 'initial-frame-alist '(fullscreen . maximized))
#+end_src
